"""Задание 3

1)	Напишите счетчик с помощью конструкции while, который выводит числа от 0 до 10.
2)	Напишите счетчик с помощью конструкции while, который выводит числа от 20 до 1.

"""
print("\n","Task 3_1","\n")
i = 10
while i >= 0:
    print(i)
    i -=1
print("\n","Task 3_2","\n")
k = 20
while k > 0:
    print(k)
    k -= 1
